#### Space Members

---

|  |
| --- |
| Space Class   Methods   Properties   See Also |

The  Space  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. (Inherited from  Element  .) |
| Public method | CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from  Element  .) |
| Public method | CanBeLocked | Identifies if the element can be locked. (Inherited from  Element  .) |
| Public method | CanDeleteSubelement | Checks if given subelement can be removed from the element. (Inherited from  Element  .) |
| Public method | CanHaveTypeAssigned | Identifies if the element can have a type assigned. (Inherited from  Element  .) |
| Public method | ChangeTypeId(ElementId) | Changes the type of the element. (Inherited from  Element  .) |
| Public method | DeleteEntity | Deletes the existing entity created by %schema% in the element (Inherited from  Element  .) |
| Public method | DeleteSubelement | Removes a subelement from the element. (Inherited from  Element  .) |
| Public method | DeleteSubelements | Removes the subelements from the element. (Inherited from  Element  .) |
| Public method | Dispose | (Inherited from  Element  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetBoundarySegments | Returns the boundary segments. (Inherited from  SpatialElement  .) |
| Public method | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. (Inherited from  Element  .) |
| Public method | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. (Inherited from  Element  .) |
| Public method | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. (Inherited from  Element  .) |
| Public method | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. (Inherited from  Element  .) |
| Public method | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. (Inherited from  Element  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetMaterialArea | Gets the area of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMaterialIds | Gets the element ids of all materials present in the element. (Inherited from  Element  .) |
| Public method | GetMaterialVolume | Gets the volume of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetOrderedParameters | Gets the parameters associated to the element in order. (Inherited from  Element  .) |
| Public method | GetParameter | Retrieves a parameter from the element given identifier. (Inherited from  Element  .) |
| Public method | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. (Inherited from  Element  .) |
| Public method | GetParameters | Retrieves the parameters from the element via the given name. (Inherited from  Element  .) |
| Public method | GetPhaseStatus | Gets the status of a given element in the input phase (Inherited from  Element  .) |
| Public method | GetSpatialElementDomainData | Gets the domain data for the spatial element. The domain data contains information of different spatial elements, such as electrical load area. Currently room/space/area don't have domain data. (Inherited from  SpatialElement  .) |
| Public method | GetSubelements | Returns the collection of element subelements. (Inherited from  Element  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetTypeId | Returns the identifier of this element's type. (Inherited from  Element  .) |
| Public method | GetValidTypes | Obtains a set of types that are valid for this element. (Inherited from  Element  .) |
| Public method | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. (Inherited from  Element  .) |
| Public method | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsExternalFileReference | Determines whether this Element represents an external file. (Inherited from  Element  .) |
| Public method | IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from  Element  .) |
| Public method | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. (Inherited from  Element  .) |
| Public method | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. (Inherited from  Element  .) |
| Public method | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsPointInSpace | Determines if a point lies within the volume of the Space. |
| Public method | IsValidType(ElementId) | Checks if given type is valid for this element. (Inherited from  Element  .) |
| Public method | LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from  Element  .) |
| Public method | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | RefersToExternalResourceReferences | Determines whether this Element uses external resources. (Inherited from  Element  .) |
| Public method | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. (Inherited from  Element  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActualExhaustAirflow | Get the Actual Exhaust Airflow of the Space. |
| Public property | ActualHVACLoad | Get the Actual HVAC Load of the Space. |
| Public property | ActualLightingLoad | Get the Actual Lighting Load of the Space. |
| Public property | ActualOtherLoad | Get the Actual Other Load of the Space. |
| Public property | ActualPowerLoad | Get the Actual Power Load of the Space. |
| Public property | ActualReturnAirflow | Get the Actual Return Airflow of the Space. |
| Public property | ActualSupplyAirflow | Get the Actual Supply Airflow of the Space. |
| Public property | AirChangesPerHour | Get the Specified AirChangesPerHour of the Space. |
| Public property | Area | The area. (Inherited from  SpatialElement  .) |
| Public property | AreaperPerson | Get or set the Area per Person of the Space. |
| Public property | AssemblyInstanceId | The id of the assembly instance to which the element belongs. (Inherited from  Element  .) |
| Public property | AverageEstimatedIllumination | Get the Average Estimated Illumination of the Space. |
| Public property | BaseHeatLoadOn | The heat load-on. |
| Public property | BaseOffset | Get or set the Base Offset of the Space. |
| Public property | BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from  Element  .) |
| Public property | CalculatedCoolingLoad | Get the Calculated Cooling Load of the Space. |
| Public property | CalculatedHeatingLoad | Get the Calculated Heating Load of the Space. |
| Public property | CalculatedSupplyAirflow | Get the Calculated Supply Airflow of the Space. |
| Public property | Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from  Element  .) |
| Public property | CeilingReflectance | Get or set the Ceiling Reflectance of the Space. |
| Public property | ClosedShell | Return the closedShell of the space. |
| Public property | ConditionType | Get or set the Condition type of the Space. |
| Public property | CreatedPhaseId | Id of a Phase at which the Element was created. (Inherited from  Element  .) |
| Public property | DemolishedPhaseId | Id of a Phase at which the Element was demolished. (Inherited from  Element  .) |
| Public property | DesignCoolingLoad | Get or set the Design Cooling Load of the Space. |
| Public property | DesignExhaustAirflow | Get or set the Specified Exhaust Airflow of the Space. |
| Public property | DesignHeatingLoad | Get or set the Design Heating Load of the Space. |
| Public property | DesignHVACLoadperArea | Get or set the Design HVAC Load per Area of the Space. |
| Public property | DesignLightingLoad | Get or set the Design Lighting Load of the Space. |
| Public property | DesignOption | Returns the design option to which the element belongs. (Inherited from  Element  .) |
| Public property | DesignOtherLoadperArea | Get or set the Design Other Load per Area of the Space. |
| Public property | DesignPowerLoad | Get or set the Design Power Load of the Space. |
| Public property | DesignReturnAirflow | Get or set the Specified Return Airflow of the Space. |
| Public property | DesignSupplyAirflow | Get or set the Specified Supply Airflow of the Space. |
| Public property | Document | Returns the Document in which the Element resides. (Inherited from  Element  .) |
| Public property | FloorReflectance | Get or set the Floor Reflectance of the Space. |
| Public property | Geometry | Retrieves the geometric representation of the element. (Inherited from  Element  .) |
| Public property | GroupId | The id of the group to which an element belongs. (Inherited from  Element  .) |
| Public property | Id | A unique identifier for an Element in an Autodesk Revit project. (Inherited from  Element  .) |
| Public property | IsModifiable | Identifies if the element is modifiable. (Inherited from  Element  .) |
| Public property | IsTransient | Indicates whether an element is transient or permanent. (Inherited from  Element  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Element  .) |
| Public property | LatentHeatGainperPerson | Get or set the Latent Heat Gain per Person of the Space. |
| Public property | Level | Gets the level of the room. (Inherited from  SpatialElement  .) |
| Public property | LevelId | The id of the level associated with the element. (Inherited from  Element  .) |
| Public property | LightingCalculationWorkplane | Get or set the Lighting Calculation Workplane of the Space. |
| Public property | LightingLoadUnit | Get or set the Lighting Load Unit of the Space. |
| Public property | LimitOffset | Get or set the Limit Offset of the Space. |
| Public property | Location | The location of the element. (Inherited from  SpatialElement  .) |
| Public property | Name | A human readable name for the Element. (Inherited from  SpatialElement  .) |
| Public property | Number | The number. (Inherited from  SpatialElement  .) |
| Public property | NumberofPeople | Get or set the Number of People of the Space. |
| Public property | OccupancyUnit | Get or set the Occupancy Unit of the Space. |
| Public property | Occupiable | Reports whether this zone is Occupiable or not. |
| Public property | OutdoorAirflow | Get the Outdoor Airflow of the Space. |
| Public property | OutdoorAirFlowStandard | Get the OutdoorAirFlowStandard of the Space. |
| Public property | OutdoorAirPerArea | Get the Specified OutdoorAirPerArea of the Space. |
| Public property | OutdoorAirPerPerson | Get the Specified OutdoorAirPerPerson of the Space. |
| Public property | OwnerViewId | The id of the view that owns the element. (Inherited from  Element  .) |
| Public property | Parameter Guid | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from  Element  .) |
| Public property | Parameter BuiltInParameter | Retrieves a parameter from the element given a parameter id. (Inherited from  Element  .) |
| Public property | Parameter Definition | Retrieves a parameter from the element based on its definition. (Inherited from  Element  .) |
| Public property | Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | Perimeter | The perimeter. (Inherited from  SpatialElement  .) |
| Public property | Pinned | Identifies if the element has been pinned to prevent changes. (Inherited from  Element  .) |
| Public property | Plenum | Reports whether this zone is Plenum or not. |
| Public property | PowerLoadUnit | Get or set the Power Load Unit of the Space. |
| Public property | ReturnAirflow | Get or set the Return type of Supply Airflow of the Space. |
| Public property | Room | Return the Room of the space. |
| Public property | SensibleHeatGainperPerson | Get or set the Sensible Heat Gain per Person of the Space. |
| Public property | SpaceCavityRatio | Get the Space Cavity Ratio of the Space. |
| Public property | SpaceConstruction | Get the Space Construction of the Space. |
| Public property | SpaceType | Get or set the Space type of the Space. |
| Public property | SpaceTypeId | Get or set the Space type element of the Space. |
| Public property | SpatialElementType | The spatial element type. (Inherited from  SpatialElement  .) |
| Public property | UnboundedHeight | Get the Unbounded Height of the Space. |
| Public property | UniqueId | A stable unique identifier for an element within the document. (Inherited from  Element  .) |
| Public property | UpperLimit | Get or set the Upper Limit of the Space. |
| Public property | VersionGuid | Get the element version Guid. (Inherited from  Element  .) |
| Public property | ViewSpecific | Identifies if the element is owned by a view. (Inherited from  Element  .) |
| Public property | Volume | Get the Volume of the Space. |
| Public property | WallReflectance | Get or set the Wall Reflectance of the Space. |
| Public property | WorksetId | Get Id of the Workset which owns the element. (Inherited from  Element  .) |
| Public property | Zone | Reports this space belong to which Zone. |

# See Also

Space Class

Autodesk.Revit.DB.Mechanical Namespace